import {makeObservable, computed, observable, action} from 'mobx';

class Store {
    @observable gallery = [
        {
            id: 0,
            description: "бугалтери ВІТІ навчатимуться за програмами країн НАТО",
            imageUrl: "https://defence-ua.com/resize_419x240/media/illustration/articles/faf61a0f974c73ea.jpg"
        },
        {
            id: 1,
            description: "ВШАНУВАННЯ ПАМ'ЯТІ ГЕРОЇВ-ЗВ'ЯЗКІВЦІВ ",
            imageUrl: "https://defence-ua.com/resize_419x240/media/illustration/articles/04761a115826507b.jpg"
        },
        {
            id: 2,
            description: "ВІТІ – це гарант соціального захисту",
            imageUrl: "https://defence-ua.com/resize_419x240/media/illustration/articles/faf61a0f974c73ea.jpg"
        },
        {
            id: 3,
            description: "Виставка-презентація навчальних закладів «Освіта-2019» у Полтаві",
            imageUrl: "http://www.viti.edu.ua/img/news/1319/1319_1.jpg"
        },
        {
            id: 4,
            description: "Відвідування інституту майбутніми абітурієнтами",
            imageUrl: "https://defence-ua.com/resize_419x240/media/illustration/articles/b91619f83a9e7114.jpg"
        },
        {
            id: 5,
            description: "ДАХК «Артем»",
            imageUrl: "https://defence-ua.com/resize_419x240/media/illustration/articles/1c3619d08de06ca1.jpg"
        },
        {
            id: 6,
            description: "Першість інституту з Армспорту",
            imageUrl: "https://defence-ua.com/resize_419x240/media/illustration/articles/ae86198c73f113b5.jpg"
        }
    ];
    @observable news = [
        {
            image: "https://defence-ua.com/resize_419x240/media/illustration/articles/04761a115826507b.jpg",
            id: 0,
            title: "Гусєв офіційно підтвердив завершення робіт з імпортозаміщення першого Ан-178-100Р",
            description: "Відзначимо, анонсована \"100% готовність\" означає, успішне виготовлення, постачання й встановлення на літак деяких нових українських складових, як то оновлених турбореактивних двигунів Д−436−148ФМ та нових титанових шасі, виробництво яких мали опанувати на ДП \"Південмаш\", хоч інформації про це офіційно не повідомлялось."
        },
        {
            image: "https://defence-ua.com/resize_419x240/media/illustration/articles/faf61a0f974c73ea.jpg",
            id: 1,
            title: "У 2022 році \"Мотор Січ\" має відвантажити замовнику 10 санітарних гелікоптерів 2МСБ-1 (відео)",
            description: "\"Ось цей гелікоптер має замовлення на 25 одиниць. Наступного року ми маємо 10 машин здати\", - зазначив В’ячеслав Богуслаєв, демонструючи 2МСБ-1, додавши, що підприємство випускає й військову версію (\"легкий ударний гелікоптер\"), яка експлуатуються військовими й закуплена та поставлена у кількості близько 20 машин."
        },
        {
            image: "https://defence-ua.com/resize_419x240/media/illustration/articles/8ee61a088c0a73cb.jpg",
            id: 2,
            title: "Бангладеш став першим експортним покупцем новітніх китайських танків Type 15",
            description: "Китай почав експортні поставки легких танків Type 15 Бангладешу паралельно з тим, що почав поставки цих бойових машин для своїх частин морської піхоти та сухопутних частин, розквартированих в Сіньцзяні.\n" +
                "\n" +
                "Піднебесна є основним постачальником озброєнь для армії Бангладешу, китайці уже постачали цій країні танки Type 59G, реактивні системи залпового вогню WS-22 та ЗРК малої дальності HQ-7. "
        },
        {
            image: "https://defence-ua.com/resize_419x240/media/illustration/articles/b91619f83a9e7114.jpg",
            id: 3, title: "Індія та ДП \"Зоря-Машпроект\" домовились про спільний проект по силовим установкам для кораблів ",
            description: "У Військовому інституті телекомунікацій та інформатизації відбувся урочистий випуск сержантського та старшинського складу військової служби за контрактом, які мають вищу освіту.\n" +
                "\n" +
                "Після оголошення наказу про присвоєння первинного військового звання «молодший лейтенант», випускникам було вручено відповідні посвідчення та офіцерські погони.\n" +
                "\n" +
                "Подібні курси дають можливість поповнити офіцерський склад військ зв′язку Збройних Сил України молодим поколінням спеціалістів, яке прагне продовжити традиції захисників рідної землі."
        },
        {
            image: "http://www.viti.edu.ua/img/news/916/916_1.jpg",
            id: 4, title: "бугалтери ВІТІ імені Героїв Крут приєдналися до великої родини українських донорів",
            description: "Зазначається, що часткова локалізація виробництва українських агрегатів до корабельних силових установок на індійських потужностях відбуватиметься за ліцензійним контрактом, BHEL виплачуватиме відповідне роялті на користь ДП ."
        },
        {
            image: "https://defence-ua.com/resize_419x240/media/illustration/articles/1c3619d08de06ca1.jpg",
            id: 5, title: "Космічне угрупування супутників України – що відомо та які перспективи ",
            description: "Загальнодержавної цільової науково-технічної космічної програми на 2021-2025 роки, коли він стане законом. У ньому передбачена розробка й створення як низки супутників, так і різноманітних необхідних систем для них (наприклад оптико-електронного сканера надвисокої просторової розрізненості)."
        },
        {
            image: "https://defence-ua.com/resize_419x240/media/illustration/articles/ae86198c73f113b5.jpg",
            id: 6, title: "Серійне виробництво українських МСБ-2 та МСБ-8, російські танки під прицілом та РС-80 з новою БЧ: події тижня від Defense Express",
            description: "Ізраїльська компанія UVision вперше представила в ОАЕ свої баражуючі боєприпаси, \"Мотор Січ\" говорить, що може за 1,5-2 роки почати серійне виробництво повністю українських МСБ-2 та МСБ-8, ДАХК \"Артем\" показав випробування РС-80 з новою бойовою частиною – розповідаємо про ці та інші новини й події тижня"
        },
        /*{
            image: "https://www.iec-expo.com.ua/cache/images/fotovistavki/oryzie/2021/otchet/photos/otchetoruj032021_800x800-equal.jpg",
            id: 7, title: "ДП ВО «Південний машинобудівний завод ім. О.М. Макарова»",
            description: "ДП ВО «Південний машинобудівний завод ім. О.М. Макарова» на власному стенді ознайомило усіх зацікавлених з наступними експонатами: рідинний ракетний двигун РД-843 «Вега»; камера згоряння рідинного ракетного двигуна РД‑8 другого ступеня ракети‑носія «Зеніт‑2» після вогневих випробувань; макет агрегатів шасі літаків Ан-140/148; макети сильфона та кулебалона."
        },
        {
            image: "https://www.iec-expo.com.ua/cache/images/fotovistavki/oryzie/2021/otchet/photos/otchetoruj032021_800x800-equal.jpg",
            id: 8, title: "АТ «Мотор Січ» та ДП «Івченко Прогрес»",
            description: "На спільній експозиції АТ «Мотор Січ» та ДП «Івченко Прогрес» показали сучасні авіаційні двигуни АІ‑322Ф, Д‑436‑148ФМ, ТВ3‑117ВМА‑СБМ1В серії 4Е, МС‑500В‑02С, повітряний гвинт MTV‑27, МС‑450. В свою чергу хочемо нагадати, що нещодавно в Туреччині БПЛА Akinci, розроблений компанією Bayraktar та оснащений двигуном виробництва ДП «Івченко Прогрес», встановив новий рекорд, досягши найбільшої висоти, яку коли‑небудь досягали БПЛА турецького виробництва."
        },
        {
            image: "https://www.iec-expo.com.ua/cache/images/fotovistavki/oryzie/2021/otchet/photos/otchetoruj032021_800x800-equal.jpg",
            id: 9, title: "Приватне акціонерне товариство «Рамзай»",
            description: "Приватне акціонерне товариство «Рамзай», що інтегрувало до своїх потужностей команду НТК «Горизонт» з їхнім проектом легкого багатоцільового вертольоту, представило модифіковану версію SL‑231 Scout. Це трьохмісний вертоліт, кабіна якого виконана з композитну і обладнана авіонікою словенської компанії Knardia (в одній з версій).\n" +
                "\n" +
                "Окрім цього, Scout може оснащуватись авіаційними бортовими системами компаній Dynon SkyView, Advanced Flight Systems, MGL. На вертоліт встановлено авіаційний двигун американської компанії Lycoming IO‑390 на 210 к.с. Вага порожнього вертольоту становить 450 кг. Максимальне корисне навантаження до 400 кг. Дальність польоту до 600 км. Крейсерська швидкість польоту близько 190 км/год."
        },
        {
            image: "https://www.iec-expo.com.ua/cache/images/fotovistavki/oryzie/2021/otchet/photos/otchetoruj032021_800x800-equal.jpg",
            id: 10,
            title: "Підписання ДК «Укрспецекспорт», що входить до складу ДК «Укроборонпром», контракту на модернізацію та ремонт літака Військово-повітряних сил (ВПС) Пакистану.",
            description: "Під час другого дня роботи виставки укладено контракт з пакистанськими партнерами на ремонт літака-заправника Іл‑78, що може використовуватись як військово-транспортний літак та призначений для дозаправлення у повітрі військових повітряних суден.\n" +
                "«За останній рік це вже другий укладений контракт на ремонт Іл‑78 для ВПС Пакистану. У червні 2020 року Укрспецекспорт переміг у тамтешньому багатомільйонному тендері на ремонт літака-заправника. За його результатами ДК «Укрспецекспорт» уклала з Управлінням закупівель Військово-повітряних сил Пакистану контракт на ремонт військових літаків. Контракт успішно виконав Миколаївський авіаремонтний завод, що входить до складу Концерну», – зазначає Генеральний директор державної компанії «Укрспецекспорт» Вадим Ноздря."
        },
        {
            image: "https://www.iec-expo.com.ua/cache/images/fotovistavki/oryzie/2021/otchet/photos/otchetoruj032021_800x800-equal.jpg",
            id: 11,
            title: "Зустріч керівництва ДК «Укроборонпром» з французькою делегацією під час заходу «Французькі дні охорони та безпеки в Україні», який був організований Посольством Франції в Україні.",
            description: "Під час заходу було обговорено можливість та перспективи укладення контрактів з тамтешніми компаніями Thales, Safran та Airbus в рамках вже підписаних меморандумів про співробітництво. Зокрема, йшлося про проекти у сферах авіабудування, бронетехніки та радіолокаційних систем."
        },
        {
            image: "https://www.iec-expo.com.ua/cache/images/fotovistavki/oryzie/2021/otchet/photos/otchetoruj032021_800x800-equal.jpg",
            id: 12,
            title: "Національна асоціація оборонної промисловості України (NAUDI) та асоціація приватних оборонних підприємств Індонезії уклали угоду про співробітництво у сфері ВПК.",
            description: "Підписантами виступили Голова NAUDI Андрій Сенченко та фінансовий директор Асоціації приватних оборонних підприємств Індонезії Хендра Гуванан.\n" +
                "Сторони домовилися, зокрема сприяти розвитку кооперації шляхом підбору партнерів та інтеграторів, реалізації партнерських проектів, зміцнення кадрового і виробничого потенціалу оборонних галузей, трансферу технологій тощо. Термін чинності угоди – 10 років з можливістю пролонгації. Угода про співпрацю з індонезійськими колегами – перший крок NAUDI на шляху до реалізації завдання з просування української військової техніки, озброєння та боєприпасів на зовнішніх ринках."
        },
        {
            image: "https://www.iec-expo.com.ua/cache/images/fotovistavki/oryzie/2021/otchet/photos/otchetoruj032021_800x800-equal.jpg",
            id: 13, title: "Підписання Меморандуму про співпрацю між NAUDI та тбіліським авіаційним заводом.",
            description: "Меморандумом закріплені наміри сторін співпрацювати у сфері безпеки та оборони задля поліпшення взаємної здатності розвивати сильну і незалежну оборонну індустрію.\n" +
                "Сторони розвиватимуть спільні проекти, в широкому спектрі оборонних напрямків, зокрема постачанні продукції для потреб військових і силових відомств України та Грузії та третіх сторін, проведенні науково-дослідних та дослідно-конструкторських робіт, організації програм навчання військовослужбовців, розвитку ланцюгів попиту і пропозиції, інтенсифікації маркетингових активностей."
        },
        {
            image: "https://www.iec-expo.com.ua/cache/images/fotovistavki/oryzie/2021/otchet/photos/otchetoruj032021_800x800-equal.jpg",
            id: 14,
            title: "Зустріч командування Національної гвардії України та командувача Генерального Інспекторату Карабінерів Молдови.",
            description: "У період відвідування виставки іноземною делегацією з Молдови були проведені переговори з командуванням Національної гвардії України, під час якої сторони досягли порозуміння щодо необхідності започаткувати співробітництво в рамках Меморандуму про взаєморозуміння між Генеральним Інспекторатом Карабінерів Міністерства внутрішніх справ Республіки Молдова та Національною гвардією України, який наразі перебуває в процесі погодження."
        }*/
    ];

    @computed get getAllImages() {
        return this.gallery;
    }

    @computed get getAllNews() {
        return this.news;
    }

    // @action.bound
    // doneTask(id){
    //     const tasks = this.tasks;
    //     const index = tasks.map(task => task.id).indexOf(id);
    //     tasks[index].done = true;
    //     this.setTasks(tasks)
    // }

    constructor() {
        makeObservable(this);
    }
}

export default Store;